# Функція для обчислення z згідно з умовами
def main(x,y):
    if x > 8:
        z = 3 + y
    else:
        z = 9 * x * y
    return z

# Отримуємо від користувача значення x та y для першої функції
x = float(input("Введіть значення x: "))
y = float(input("Введіть значення y: "))

# Викликаємо першу функцію та виводимо результат
result1 = main(x, y)
print("Результат першої функції: ", result1)

# Отримуємо від користувача значення n для обчислення факторіала
n = int(input("Введіть значення n для обчислення факторіала: "))

# Викликаємо другу функцію з модуля та виводимо результат
from factorial import calculate_factorial
result2 = calculate_factorial(n)
print(f"Факторіал {n}!: {result2}")

